# Project on Logistic Regression (Machine Learning)

### Import Libraries

In [12]:
import pandas as pd

### Load Data

In [43]:
train = pd.read_csv("train.csv")

### Creating DataFrame

In [14]:
df = pd.DataFrame(train)

### Uncleaned Data

In [15]:
df

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.0000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
663,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,S,1
664,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,372622,7.7500,NaN,Q,0
665,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,S,1
666,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,NaN,S,0
667,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,Q,1

### Droping (Name, Ticket, Cabin) columns as it is not that much useful for prediction

In [16]:
df = df.drop(["Name","Ticket","Cabin"], axis=1)
df

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0         2  female  29.0      1      0  26.0000        S         1
1         3    male   NaN      0      0   8.0500        S         0
2         2    male  39.0      0      0  26.0000        S         0
3         3  female  29.0      0      4  21.0750        S         0
4         3    male  25.0      0      0   7.0500        S         0
..      ...     ...   ...    ...    ...      ...      ...       ...
663       2  female  17.0      0      0  10.5000        S         1
664       3    male   NaN      0      0   7.7500        Q         0
665       3    male  32.0      0      0  56.4958        S         1
666       3  female  22.0      0      0   9.8375        S         0
667       3  female   NaN      1      0  15.5000        Q         1

[668 rows x 8 columns]

### Handling Categorical Values

In [17]:
genders = {'male':0,'female':1}
df1 = [df]

for dataset in df1:
    dataset['Sex'] = dataset['Sex'].map(genders)

embarkeds = {'S':0,'Q':1,'C':2}
df2 = [df]

for dataset in df2:
    dataset['Embarked'] = dataset['Embarked'].map(embarkeds)

### Handling NAN Values

In [18]:
mean = df['Age'].mean()
df.Age.fillna(mean,inplace=True)
df.Embarked.fillna(0,inplace=True)

### Cleaned Data

In [19]:
df

     Pclass  Sex       Age  SibSp  Parch     Fare  Embarked  Survived
0         2    1  29.00000      1      0  26.0000       0.0         1
1         3    0  29.70056      0      0   8.0500       0.0         0
2         2    0  39.00000      0      0  26.0000       0.0         0
3         3    1  29.00000      0      4  21.0750       0.0         0
4         3    0  25.00000      0      0   7.0500       0.0         0
..      ...  ...       ...    ...    ...      ...       ...       ...
663       2    1  17.00000      0      0  10.5000       0.0         1
664       3    0  29.70056      0      0   7.7500       1.0         0
665       3    0  32.00000      0      0  56.4958       0.0         1
666       3    1  22.00000      0      0   9.8375       0.0         0
667       3    1  29.70056      1      0  15.5000       1.0         1

[668 rows x 8 columns]

### Checkout the Null Values in Data

In [21]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

### Spliting data

In [26]:
x = df.iloc[:,:-1].values
y = df.iloc[:,-1].values
x.shape,y.shape

((668, 7), (668,))

### Feature Scaling

In [28]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
x = sc_x.fit_transform(x)

In [32]:
x.shape

(668, 7)

### Train the Model

In [35]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(random_state=0)
classifier.fit(x,y)

LogisticRegression(random_state=0)

### Predict the Values

In [36]:
y_pred = classifier.predict(x)

### Finding Accuracy

In [39]:
from sklearn.metrics import accuracy_score

In [40]:
print(accuracy_score(y,y_pred))

0.7934131736526946